---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Plumbing.PipeType
source: html/3935aa51-c85e-021e-2917-84929068a91e.htm
---
# PipeType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.